{
  "bot-account": {
    "username": "Chutiya", 
    "password": "",
    "type": "mojang"
  },

  "server": {
    "ip": "KarmaBlocks.aternos.me", 
    "port": 12559,   
    "version": "1.12.1"   
  },
  
  "position": {
    "enabled": false,
    "x": 0,
    "y": 0,
    "z": 0
  },

  "utils": {
    "auto-auth": {
      "enabled": false,
      "password": ""
    },

    "anti-afk": {
      "enabled": true,
      "sneak": true
    },

    "chat-messages": {
      "enabled": true,
      "repeat": true,
      "repeat-delay": 60,

      "messages": [
     "It always seems impossible until it’s done.-Nelson Mandela",
        "Success is not final, failure is not fatal: It is the courage to continue that counts.-Winston Churchill",
        "The best way to predict the future is to create it.-Abraham Lincoln",
        "Your work is going to fill a large part of your life, and the only way to be truly satisfied is to do what you believe is great work. And the only way to do great work is to love what you do. - Steve Jobs",
        "You must be the change you wish to see in the world. - Mahatma Gandhi",
        "The biggest adventure you can take is to live the life of your dreams. - Oprah Winfrey",
        "Genius is one percent inspiration and ninety-nine percent perspiration. - Thomas Edison",
        "Efforts and courage are not enough without purpose and direction. - John F. Kennedy",
        "The best way to not feel hopeless is to get up and do something. - Barack Obama",
        "Whether you think you can, or you think you can’t – you’re right. - Henry Ford",
        "Don’t watch the clock; do what it does. Keep going. - Sam Levenson",
        "Success is not how high you have climbed, but how you make a positive difference to the world. - Roy T. Bennett",
        "It’s not whether you get knocked down, it’s whether you get up. - Vince Lombardi",
        "I find that the harder I work, the more luck I seem to have. - Thomas Jefferson",
        "The only limit to our realization of tomorrow is our doubts of today. - Franklin D. Roosevelt",
        "Success usually comes to those who are too busy to be looking for it. - Henry David Thoreau",
        "Success is the sum of small efforts, repeated day in and day out. - Robert Collier",
        "The only way to do great work is to love what you do. - Steve Jobs",
        "Success is not in what you have, but who you are. - Bo Bennett",
        "The harder the battle, the sweeter the victory. - Les Brown"
      ]
    },

    "chat-log": true,
    "auto-reconnect": true,
    "auto-recconect-delay": 5000
  }
}
